In [1]:
import pandas as pd

In [35]:
#Zad 1
df=pd.read_csv('/Users/michalluniewski/Documents/PAD/03_PAD/Zadania_domowe/PAD_03_PD.csv', sep=';')
df

      ID Country  owns_car  owns_TV  owns_house  owns_Phone gender  Age
0      1       A       0.0      0.0         0.0           1      M   61
1      2       B       0.0      0.0         0.0           1      M   44
2      3       A       0.0      0.0         0.0           1      M   56
3      4       A       0.0      0.0         0.0           1      M   53
4      5       C       1.0      1.0         0.0           1      K   60
..   ...     ...       ...      ...         ...         ...    ...  ...
795  796       B       0.0      0.0         0.0           1      K   28
796  797       B       0.0      0.0         0.0           1      M   26
797  798       A       0.0      0.0         0.0           1      M   61
798  799       B       0.0      1.0         0.0           1      K   47
799  800       B       0.0      1.0         0.0           1      K   51

[800 rows x 8 columns]

In [43]:
#Replace missing values with the most frequent value in the column
cols = ['Country','owns_car', "owns_TV", 'owns_house', 'owns_Phone', 'Age', 'gender']
df[cols]=df[cols].fillna(df.mode().iloc[0])
df

      ID Country  owns_car  owns_TV  owns_house  owns_Phone gender  Age
0      1       A       0.0      0.0         0.0           1      M   61
1      2       B       0.0      0.0         0.0           1      M   44
2      3       A       0.0      0.0         0.0           1      M   56
3      4       A       0.0      0.0         0.0           1      M   53
4      5       C       1.0      1.0         0.0           1      K   60
..   ...     ...       ...      ...         ...         ...    ...  ...
795  796       B       0.0      0.0         0.0           1      K   28
796  797       B       0.0      0.0         0.0           1      M   26
797  798       A       0.0      0.0         0.0           1      M   61
798  799       B       0.0      1.0         0.0           1      K   47
799  800       B       0.0      1.0         0.0           1      K   51

[800 rows x 8 columns]

In [44]:
df.groupby('Country').count()

          ID  owns_car  owns_TV  owns_house  owns_Phone  gender  Age
Country
A        335       335      335         335         335     335  335
B        201       201      201         201         201     201  201
C        186       186      186         186         186     186  186
D         78        78       78          78          78      78   78

In [46]:
#Zad 2
df['Owned_Goods'] = df.owns_car + df.owns_TV + df.owns_house + df.owns_Phone
df

,ID,Country,owns_car,owns_TV,owns_house,owns_Phone,gender,Age,Owned_Goods
0,1,A,0.0,0.0,0.0,1,M,61,1.0
1,2,B,0.0,0.0,0.0,1,M,44,1.0
2,3,A,0.0,0.0,0.0,1,M,56,1.0
3,4,A,0.0,0.0,0.0,1,M,53,1.0
4,5,C,1.0,1.0,0.0,1,K,60,3.0
...,...,...,...,...,...,...,...,...,...
795,796,B,0.0,0.0,0.0,1,K,28,1.0
796,797,B,0.0,0.0,0.0,1,M,26,1.0
797,798,A,0.0,0.0,0.0,1,M,61,1.0
798,799,B,0.0,1.0,0.0,1,K,47,2.0
799,800,B,0.0,1.0,0.0,1,K,51,2.0

In [57]:
#Zad 3
df.groupby('gender').mean().Owned_Goods.round(2)

gender
K    2.79
M    0.91
Name: Owned_Goods, dtype: float64

In [80]:
#Zad 4
CountryMean = df.groupby('Country').mean().Owned_Goods.round(2)
AgeMin = df.groupby('Country').min().Age
NewDf = pd.merge(CountryMean, AgeMin, how='outer', on='Country')
NewDf

         Owned_Goods  Age
Country
A               0.87   18
B               1.45   18
C               3.02   18
D               4.00   18